elot-defs.org
* Helper functions for ELOT
** elisp functions -- tangling to ~elot-package/elot.el~
:PROPERTIES:
:header-args: :tangle ./elot-package/elot.el :comments link
:END:
*** Header for the elisp file
Block native compilation with ~no-native-compile: t;~. This (apparently)
allows for local variables to be accessed -- relevant for
~org-link-abbrev-alist-local~, which is needed for abbreviation of URIs
in SPARQL select results.
#+name: src-package-header
#+begin_src emacs-lisp :comments nil
  ;;; elot.el --- Emacs Literate Ontology Tool (ELOT)   -*- lexical-binding: t; no-native-compile: t; -*-

  ;; Copyright (C) 2024, 2025 Johan W. Klüwer

  ;; Author: Johan W. Klüwer <johan.w.kluwer@gmail.com>
  ;; URL: https://github.com/johanwk/elot
  ;; Version: 1.0.6
  ;; Package-Requires: ((emacs "29.1") (htmlize "1.58") (ht "2.3") (omn-mode "1.3") (hydra "0.15.0") (sparql-mode "4.0.2"))
  ;; Keywords: languages outlines tools org ontology

  ;; This file is not part of GNU Emacs.

  ;; This program is free software; you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.

  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.

  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

  ;;; Commentary:

  ;; This package is for authoring OWL ontologies using org-mode.

  ;; To start an ontology from scratch using ELOT, open an Org file and
  ;; use predefined "tempo" templates.

  ;;  - insert `<odh' and hit <Tab> to add a header for the document
  ;;  - insert `<ods' and hit <Tab> to insert headers for the ontology,
  ;;    classes, properties, and individuals.

  ;; Shift-<F5> will open a "hydra" menu with more templates and
  ;; functions for exporting to an ontology file or HTML.

  ;; Please consult the package Github site for more information:
  ;;        <https://github.com/johanwk/elot>

  ;;; Code:
#+end_src

*** Require packages
#+name: src-require
#+begin_src emacs-lisp
	(require 'ob-lob) ; Library of Babel
	(require 'ox) ; export functions
	(require 'ol) ; link functions
	(require 'org-tempo) ; document templates
	(require 'htmlize) ; fontify blocks
	(require 'omn-mode) ; OWL Manchester Syntax (OMN) support
	(require 'sparql-mode) ; SPARQL
	(require 'ob-sparql) ; SPARQL in org-babel
	(require 'ob-plantuml) ; PlantUML in org-babel
	(require 'hydra) ; hydra menu
	(require 'ht) ; hashtable, for label display
	(require 'url) ; for opening online ontologies
	(require 'url-http) ; for opening online ontologies
	(require 'xref) ; jump around
	(require 'button) ; for text‑buttons
	(require 'help-mode) ; nice keymap & look
#+end_src
*** Setting for post-processing with ROBOT, rdfpuml; import OWL with elot-exporter
Se below under [[*Default settings][Default settings]] for a hook to convert to Turtle after
tangling to OMN.
#+name: src-settings-externals
#+begin_src emacs-lisp
  (defgroup elot
    nil
    "Customization group for Emacs Literate Ontology Tool (ELOT)."
    :prefix "elot-"
    :group 'elot)
  (defcustom elot-robot-jar-path (expand-file-name "~/bin/robot.jar")
    "Path to the robot.jar file."
    :group 'elot
    :version "29.2"
    :type 'string)
  (defvar elot-robot-command-str
    (concat "java -jar " elot-robot-jar-path))
  (defcustom elot-exporter-jar-path (expand-file-name "~/bin/elot-exporter.jar")
    "Path to the elot-exporter.jar file."
    :group 'elot
    :version "29.2"
    :type 'string)
  (defvar elot-exporter-command-str
    (concat "java -jar " elot-exporter-jar-path))
  (defvar elot-last-org-source nil
    "Path to the last Org-mode file that generated an OMN file.")
  (defun elot--remember-org-source ()
    "Remember the current Org file for use after tangling."
    (setq elot-last-org-source (buffer-file-name)))
  (defun elot-robot-command (cmd)
    "Execute ROBOT command CMD using `shell-command'.
    Check whether `elot-robot-jar-path` is set and points to an existing file.
    It not set, return an error."
    (if (or (string= elot-robot-jar-path "") (not (file-exists-p elot-robot-jar-path)))
        (error "ROBOT not found.  Set elot-robot-jar-path with M-x customize-variable"))
    (shell-command (concat elot-robot-command-str " " cmd)))

  ;; Helper function for synchronous batch execution
  (defun elot-robot-omn-to-ttl--batch (omnfile output-file command-args)
    "Perform synchronous ROBOT conversion for batch mode.
  Handles process execution via `call-process`, output parsing on error,
  and calls `kill-emacs` on failure.
  OMNFILE, OUTPUT-FILE are file paths. COMMAND-ARGS is the full
  list of arguments for the process, starting with \"java\"."
    (let* ((output-buffer (generate-new-buffer "*ROBOT Output (Batch)*"))
           (process-connection-type nil) ; Important for batch stability
           (exit-code nil))
      (message "[elot-robot-omn-to-ttl Batch] Executing synchronously: %s" (mapconcat #'shell-quote-argument command-args " "))
      (unwind-protect ; Ensure buffer cleanup
          (progn
            ;; Execute: program is first element, rest are args
            (setq exit-code (apply #'call-process (car command-args) nil output-buffer t (cdr command-args)))
            (message "[elot-robot-omn-to-ttl Batch] ROBOT process finished with exit code: %d" exit-code)

            (if (= exit-code 0)
                ;; Success Case (Batch)
                (message "ROBOT: Conversion of %s successful: %s" omnfile output-file)

              ;; Failure Case (Batch)
              (progn
                (message "ROBOT: Conversion failed (exit code %d)." exit-code)
                ;; Try to extract specific error, suppress full output
                (with-current-buffer output-buffer
                  (goto-char (point-min))
                  (if (and (re-search-forward ; Look for specific parser error
                            "^Parser: org\\.semanticweb\\.owlapi\\.manchestersyntax\\.parser\\.ManchesterOWLSyntaxOntologyParser" nil t)
                           (re-search-forward "Encountered"))
                      ;; Found specific error - extract and print ONLY that
                      (let* ((start (line-beginning-position))
                             (end (or (and (re-search-forward
                                            "org\\.semanticweb\\.owlapi\\.manchestersyntax\\.parser\\.ManchesterOWLSyntaxOntologyParser" nil t)
                                           (line-beginning-position))
                                      (point-max)))
                             (error-text (buffer-substring-no-properties start end)))
                        (message "ROBOT parse error detected:\n%s" error-text))
                    ;; Didn't find specific error - print generic failure message
                    (message "ROBOT failed. Full output suppressed. No specific parse error found.")))
                ;; Exit Emacs directly with non-zero status using kill-emacs
                (kill-emacs 1))) ; <--- Signal failure without Elisp error
            )
        ;; Cleanup (called by unwind-protect)
        (when (buffer-live-p output-buffer)
          (kill-buffer output-buffer)))))

  ;; Helper function for asynchronous interactive execution
  (defun elot-robot-omn-to-ttl--interactive (omnfile output-file command-args)
    "Perform asynchronous ROBOT conversion for interactive mode.
  Handles process execution via `make-process` and sets up a sentinel
  for feedback and error handling (including potential jumping).
  OMNFILE, OUTPUT-FILE are file paths. COMMAND-ARGS is the full
  list of arguments for the process, starting with \"java\"."
    (let* ((buffer-name "*ROBOT Errors (Interactive)*")
           (buffer (get-buffer-create buffer-name)))
      (message "[elot-robot-omn-to-ttl Interactive] Starting asynchronous process.")
      (with-current-buffer buffer (erase-buffer))
      (make-process
       :name "robot-convert-interactive"
       :buffer buffer
       :command command-args ; Pass the full list including "java"
       :stderr buffer
       :noquery t
       :sentinel
       ;; Sentinel logic - suitable for interactive use
       (lambda (proc event)
         (when (not (process-live-p proc))
           (if (= (process-exit-status proc) 0)
               (message "ROBOT: Conversion successful: %s" output-file)
             ;; --- Failure Case (Interactive) ---
             (with-current-buffer buffer
               (goto-char (point-min))
               (if (and (re-search-forward
                         "^Parser: org\\.semanticweb\\.owlapi\\.manchestersyntax\\.parser\\.ManchesterOWLSyntaxOntologyParser" nil t)
                        (re-search-forward "Encountered"))
                   ;; Found specific error - show it and try to jump
                   (let* ((start (line-beginning-position))
                          (end (or (and (re-search-forward
                                         "org\\.semanticweb\\.owlapi\\.manchestersyntax\\.parser\\.ManchesterOWLSyntaxOntologyParser" nil t)
                                        (line-beginning-position))
                                   (point-max)))
                          (error-text (buffer-substring-no-properties start end))
                          ;; Attempt parsing location, ignore errors if it fails
                          (loc (ignore-errors (elot--parse-robot-error-location error-text))))
                     (message "ROBOT parse error:\n%s" error-text)
                     (when loc ; Only jump if location parsing worked
                       (elot--jump-to-omn-error omnfile (car loc) (cadr loc))
                       (elot--jump-to-org-heading-for-identifier omnfile (car loc))))
                 ;; Didn't find specific error - show generic message & buffer name
                 (message "ROBOT failed, but no parse error could be extracted. See buffer %s." buffer-name))
               ;; Optional: Display the error buffer for the user interactively
               ;; (display-buffer buffer)
               )))))))

  ;; Main dispatcher function
  (defun elot-robot-omn-to-ttl (omnfile)
    "Convert OMNFILE (Manchester Syntax) to Turtle using ROBOT.
  Dispatches to synchronous batch or asynchronous interactive helpers.
  Checks for `elot-robot-jar-path`."

    ;; --- Common Setup ---
    (message "[elot-robot-omn-to-ttl] Starting conversion for: %s (Mode: %s)"
             omnfile (if noninteractive "Batch" "Interactive"))
    (unless (and (boundp 'elot-robot-jar-path) elot-robot-jar-path (file-exists-p elot-robot-jar-path))
      (error "elot-robot-jar-path is not set or invalid: %s" elot-robot-jar-path))

    (let* ((output-file (concat (file-name-sans-extension omnfile) ".ttl"))
           ;; Base command arguments list (suitable for both helpers)
           (command-args (list "java" "-jar" elot-robot-jar-path
                               "convert" "-vvv" ; Keep verbose ROBOT output for parsing
                               "--input" omnfile
                               "--output" output-file)))

      (message "[elot-robot-omn-to-ttl] Target ttlfile: %s" output-file)

      ;; --- Dispatch based on mode ---
      (if noninteractive
          (elot-robot-omn-to-ttl--batch omnfile output-file command-args)
        (elot-robot-omn-to-ttl--interactive omnfile output-file command-args))))

  (defun elot--parse-robot-error-location (text)
    "Extract (line column) from ROBOT error TEXT.  Return list of integers or nil."
    (when (string-match "Line \\([0-9]+\\) column \\([0-9]+\\)" text)
      (list (string-to-number (match-string 1 text))
            (string-to-number (match-string 2 text)))))

  (defun elot--jump-to-omn-error (omnfile line col)
    "Open OMNFILE and move point to LINE and COL."
    (let ((buf (find-file-other-window omnfile)))
      (with-current-buffer buf
        (goto-char (point-min))
        (forward-line (1- line))
        (forward-char (1- col))
        ;;(pulse-momentary-highlight-one-line (point))
        )))

  (defun elot--jump-to-org-heading-for-identifier (omnfile line)
    "From OMNFILE and error LINE, search upward for a declaration.
    Jump to the Org-mode heading defining the identifier found."
    (let ((identifier nil))
      (save-excursion
        (with-current-buffer (find-file-noselect omnfile)
          (goto-char (point-min))
          (forward-line (1- line))
          (end-of-line)
          (when (re-search-backward "^[^ \t]" nil t)
            (let ((line-text (buffer-substring-no-properties
                              (line-beginning-position) (line-end-position))))
              (when (string-match "^\\([A-Za-z]+\\):[ \t]+\\(.+\\)" line-text)
                (setq identifier (match-string 2 line-text)))))))
      (when (and identifier elot-last-org-source (file-exists-p elot-last-org-source))
        (let ((buf (find-file-other-window elot-last-org-source)))
          (with-current-buffer buf
            (goto-char (point-min))
            (if (re-search-forward
                 (format "^\\(?:\\*+ .*\\b%s\\b\\|.*::.*%s\\)"
                         (regexp-quote identifier)
                         (regexp-quote identifier))
                 nil t)
                (progn
                  (beginning-of-line)
                  ;;(pulse-momentary-highlight-one-line (point))
                  ;;(message "Parse error traced to heading: %s" (match-string 0))
                  )
              (message "Could not find Org heading for: %s" identifier)))))))
  (defun elot-tangled-omn-to-ttl ()
    "After tangling to OMN, call ROBOT to convert to Turtle."
    (let* ((omnfile (buffer-file-name))  ;; will run in the tangled buffer
           (omn-p (string-match-p ".omn$" omnfile)))
      (if omn-p
          (elot-robot-omn-to-ttl omnfile))))
  (defcustom elot-default-image-path "./images/"
    "ELOT default output directory for generated images."
    :group 'elot
    :version "29.2"
    :type 'string)
  (defcustom elot-rdfpuml-path (expand-file-name "~/bin/rdf2rml/bin/rdfpuml.pl")
    "Path to the rdfpuml Perl program."
    :group 'elot
    :version "29.2"
    :type 'string)
  (defcustom elot-rdfpuml-options
    "hide empty members
    hide circle
    skinparam classAttributeIconSize 0"
    "Default options for rdfpuml."
    :group 'elot
    :version "29.2"
    :type 'string)
  (defcustom elot-rdfpuml-command-str
    (if (executable-find "rdfpuml") ;; rdfpuml.exe available
        "rdfpuml"  ;; LC_ALL=C should be added, but not available in Windows
      (concat "perl -C -S " elot-rdfpuml-path))
    "Command to execute `rdfpuml'."
    :group 'elot
    :version "29.2"
    :type 'string)
  (defun elot-rdfpuml-command (ttl-file)
    "Command to execute rdfpuml to generate diagram from TTL-FILE."
    (shell-command (concat elot-rdfpuml-command-str " " ttl-file)))
#+end_src
