elot-defs.org
*** Make stable links in export (except LaTeX)
#+name: src-stable-links-export
#+begin_src emacs-lisp
(defun elot--prepare-export-buffer (backend)
  "Prepare the export clone for Elot:

  - Give each resource-declaring headline a CUSTOM_ID (if missing).
  - Replace every visible CURIE with an internal link to that ID,
    except when the CURIE is inside a src/example/fixed-width block."
  (when (org-export-derived-backend-p backend 'latex)
    (cl-return-from elot--prepare-export-buffer))
  ;; ------------------------------------------------------------
  ;; 0  Reveal and synchronously fontify the whole clone
  ;; ------------------------------------------------------------
  (org-fold-show-all)
  (elot-label-display-setup)
  (font-lock-fontify-buffer)

  ;; ------------------------------------------------------------
  ;; 1  Ensure CUSTOM_ID drawers
  ;; ------------------------------------------------------------
  (let (pending)                                   ; (marker . id) pairs
    (org-with-wide-buffer
     (org-element-map (org-element-parse-buffer 'headline) 'headline
       (lambda (hl)
         (let* ((title (org-element-property :raw-value hl))
                (id    (elot-entity-from-header title t)))
           (when id
             (let ((m (copy-marker (org-element-property :begin hl))))
               (unless (org-entry-get m "CUSTOM_ID")
                 (push (cons m id) pending)))))))
     ;; Insert from bottom to top so earlier insertions don’t shift markers
     (dolist (cell (nreverse pending))
       (org-with-point-at (car cell)
         (org-entry-put (car cell) "CUSTOM_ID" (cdr cell)))))

    ;; ------------------------------------------------------------
    ;; 2  Link-ify CURIEs, skipping literal blocks
    ;; ------------------------------------------------------------
    (goto-char (point-min))
    (while-let ((match (text-property-search-forward 'elot-label-display)))
      (let* ((label (prop-match-value match))
             (start (prop-match-beginning match))
             (end   (prop-match-end match))
             (container
              (org-element-lineage
               (org-element-context)
               '(src-block example-block fixed-width) t)))
        ;; If we’re inside a literal block, jump to its end and continue
        (if container
            (goto-char (org-element-property :end container))
          ;; Otherwise build the internal link
          (let* ((resource (buffer-substring-no-properties start end)) ; ex:Apple
                 (target   (concat "#" resource))
                 (link     (if (and (stringp label)
                                    (not (string= label resource)))
                               (concat "[[" target "][" label "]]")
                             (concat "[[" target "][" resource "]]"))))
            (delete-region start end)
            (goto-char start)
            (insert link)))))))

(add-hook 'org-export-before-processing-hook #'elot--prepare-export-buffer)
#+end_src
*** Headings in LaTeX export
We format headings with indentation to match the subtype level in the
ontology: for each level down we add a full stop and a space.

# Consider using a different symbol, for instance the unicode ↳, in elot-latex-filter-headline-dots

#+name: src-latex-section-export
#+begin_src emacs-lisp
  (defun elot-ontology-resource-section (level numbered-p)
    "Return LaTeX environment by subsection depth LEVEL.
  If NUMBERED-P is `true', create a numbered section."
    (if numbered-p
      (cond
        ((= 1 level) "\\chapter{%s}")
        ((= 2 level) "\\section{%s}")
        ((= 3 level) "\\subsection{%s}")
        ((= 4 level) "\\subsubsection{%s}")
        ((= 5 level) "\\subsubsubsection{%s}")
        ((= 6 level) "\\paragraph{%s}")
        (t "\\subparagraph{%s}"))
      (cond ;; Koma-script commands, see https://tex.stackexchange.com/questions/193767/how-to-use-unnumbered-chapters-with-koma-script/193799#193799
       ((= 1 level) "\\addchap{%s}")
       ((= 2 level) "\\addsec{%s}")
       ((= 3 level) "\\subsection*{%s}")
       (t "\\subsubsection*{%s}"))))
#+end_src

The function =elot-latex-filter-headline-dots= is not in use. It's for adding
indentation to sub-sections instead of deep numbering. This may become
useful sometime.
#+name: src-latex-heading-filter
#+begin_src emacs-lisp :tangle no
  (defun elot-latex-filter-headline-dots (text backend info)
    "Ensure dots in headlines."
    (when (org-export-derived-backend-p backend 'latex)
      (let* ((prop-point (next-property-change 0 text))
             (this-element (plist-get (text-properties-at prop-point text) :parent))
             (this-element-level (org-element-property :level this-element))
             (resourcedef-p (org-export-get-node-property :RESOURCEDEFS this-element t)))
        (when (and resourcedef-p (> this-element-level 2))
          (string-match "section\\(.?\\){" text)
          (replace-match (concat "section\\1{\\\\itshape{}"
           (apply 'concat (make-list (- this-element-level 3) ".\\\\space{}")))
                         nil nil text)))))
#+end_src
*** For use in org-ql
**** Get headings without cookies
The function =org-get-heading= will include "cookies" that track task
completion in the text. So we get "lis:Dependent [4/4]" instead of just
"lis:Dependent". The following strips off the cookie.
#+name: src-get-heading-nocookie
#+begin_src emacs-lisp
  (defun elot-org-get-heading-nocookie (&optional no-tags no-todo no-priority no-comment)
    "Call `org-get-heading' but strip out any task progress cookie, like `[3/4]'.
  If provided, optional arguments NO-TAGS, NO-TODO, NO-PRIORITY, and NO-COMMENT
  are passed on to `org-get-heading'."
    (replace-regexp-in-string " \\[[[:digit:]/%]+\\]$" ""
                              (org-get-heading no-tags no-todo no-priority no-comment)))
#+end_src
**** Get text of description list entry
This function is not in use.
#+name:src-get-description-entry :tangle no
#+begin_src emacs-lisp
  (defun elot-org-get-description-entry (tag)
    "Search forward for TAG and return text of Org element found.
  Remove string decorations.  Newlines are replaced by spaces in the result."
    (save-excursion
      (if (search-forward-regexp tag nil t)
          (let* ((element (org-element-at-point))
                 (beg (org-element-property :contents-begin element))
                 (end (org-element-property :contents-end element))
                 (entry-text (buffer-substring-no-properties beg end)))
            (replace-regexp-in-string "\n\s*" " " entry-text)))))
#+end_src
*** Exporting with replacements of description list tags
<<exporting-dlists>>
Execute export with "special formatting" with
: (org-export-to-file 'ELOT-latex "ELOT.tex")

NOTE. The following should be rewritten, using a filter like in =elot-latex-filter-omn-list=.

See https://emacs.stackexchange.com/questions/55231/org-mode-export-html-add-name-attirbute-to-checkbox-input.
#+name: src-latex-export-replacenames
#+begin_src emacs-lisp
  (org-export-define-derived-backend 'ELOT-latex 'latex
    :translate-alist '((item . elot-my-item-translator)))
  (defvar elot-item-process nil
    "Toggle during LaTeX export, to turn replacement of list items on or off.
  Used in `elot-my-item-translator'.")

  (defun elot-my-item-translator (item c info)
    "Translator for LaTeX export, replace RDF identifiers with simpler labels.
  This makes for more readable output in description lists.  A list serves
  to map selected annotation properties to shorter labels.  For example,
  `iof-av:explanatoryNote' will be replaced by `explanatory note'.

  ITEM is an entry in a description list.  C is the contents of the item.
  INFO is a plist holding contextual information.  See the documentation
  for `org-latex-item'.

  Translation is turned on when the magic value `item-translate-start' is
  found in a description list, and off when `item-translate-stop' is found.

  This function is a workaround.  It relies on magic strings because
  positions in the buffer are unpredictable while the export is being
  conducted."
    (let* ((item-tag-maybe (car (org-element-property :tag item)))
           (item-tag-stringp (stringp item-tag-maybe))
           (item-tag (if item-tag-stringp (substring-no-properties item-tag-maybe) item-tag-maybe)))
      (if (and item-tag-stringp (string= item-tag "item-translate-start")) (setq elot-item-process t))
      (if (and item-tag-stringp (string= item-tag "item-translate-stop")) (setq elot-item-process nil))
      (when (and elot-item-process item-tag-stringp)
        (progn
                                          ;(message (substring-no-properties item-tag))
          (setf (plist-get (cadr item) :checkbox) nil)  ; set checkbox here
          (let ((tag-mapped (assoc item-tag
                   (quote
                    (("iof-av:isPrimitive" . "primitive?")
                     ("iof-av:naturalLanguageDefinition" . "definition")
                     ("iof-av:primitiveRationale" . "why primitive")
                     ("iof-av:usageNote" . "usage note")
                     ("owl:deprecated" . "deprecated?")
                     ("rdfs:seeAlso" . "see also")
                     ("skos:example" . "example")
                     ("skos:scopeNote" . "scope note")
                     ("skos:altLabel" . "alternative label")
                     ("iof-av:explanatoryNote" . "explanatory note")
                     ("rdfs:comment" . "comment")
                     ("rdfs:isDefinedBy" . "defined by")
                     ("iof-av:firstOrderLogicDefinition" . "first-order logic definition")
                     ("iof‑av:semiFormalNaturalLanguageDefinition" . "semi-formal definition")
                     ("iof-av:semiFormalNaturalLanguageAxiom" . "semi-formal axiom")
                     ("iof-av:adaptedFrom" . "adapted from")
                     ("iof-av:synonym" . "synonym"))))))
            (if tag-mapped
                (setf (plist-get (cadr item) :tag) (cdr tag-mapped))))))
      (unless (and item-tag-stringp
                   (or (string= item-tag "item-translate-start") (string= item-tag "item-translate-stop")))
        (org-latex-item item c info))))
#+end_src

#+RESULTS: defun-ELOT-latex-derived-backend
: elot-my-item-translator

#+name: item-tag-name-map
| annotation property                        | entry text                   |
|--------------------------------------------+------------------------------|
| iof-av:isPrimitive                         | primitive?                   |
| iof-av:naturalLanguageDefinition           | definition                   |
| iof-av:primitiveRationale                  | why primitive                |
| iof-av:usageNote                           | usage note                   |
| owl:deprecated                             | deprecated?                  |
| rdfs:seeAlso                               | see also                     |
| skos:example                               | example                      |
| skos:scopeNote                             | scope note                   |
| skos:altLabel                              | alternative label            |
| iof-av:explanatoryNote                     | explanatory note             |
| rdfs:comment                               | comment                      |
| rdfs:isDefinedBy                           | defined by                   |
| iof-av:firstOrderLogicDefinition           | first-order logic definition |
| iof‑av:semiFormalNaturalLanguageDefinition | semi-formal definition       |
| iof-av:semiFormalNaturalLanguageAxiom      | semi-formal axiom            |
| iof-av:adaptedFrom                         | adapted from                 |
| iof-av:synonym                             | synonym                      |

#+begin_src emacs-lisp :var tagmap=item-tag-name-map :results code :tangle no :wrap "src emacs-lisp :tangle no"
(mapcar (lambda (x) (cons (car x) (cadr x))) tagmap)
#+end_src

#+RESULTS:
#+begin_src emacs-lisp :tangle no
(("iof-av:isPrimitive" . "primitive?")
 ("iof-av:naturalLanguageDefinition" . "definition")
 ("iof-av:primitiveRationale" . "why primitive")
 ("iof-av:usageNote" . "usage note")
 ("owl:deprecated" . "deprecated?")
 ("rdfs:seeAlso" . "see also")
 ("skos:example" . "example")
 ("skos:scopeNote" . "scope note")
 ("skos:altLabel" . "alternative label")
 ("iof-av:explanatoryNote" . "explanatory note")
 ("rdfs:comment" . "comment")
 ("rdfs:isDefinedBy" . "defined by")
 ("iof-av:firstOrderLogicDefinition" . "first-order logic definition")
 ("iof‑av:semiFormalNaturalLanguageDefinition" . "semi-formal definition")
 ("iof-av:semiFormalNaturalLanguageAxiom" . "semi-formal axiom")
 ("iof-av:adaptedFrom" . "adapted from")
 ("iof-av:synonym" . "synonym"))
#+end_src

To to find the positions where we start and end the tag
replacements. /But/, this isn't usable, because the tangled ontology
content influences position numbers /at export/.
#+begin_src emacs-lisp :tangle no
  (save-excursion
    (goto-char (point-min))
    (search-forward-regexp "* IDO Entities")
    (let* ((entry (org-element-at-point))
           (start (org-element-property :begin entry))
           (end (org-element-property :end entry)))
      (cons start end)))
#+end_src

#+RESULTS:
: (35634 . 204383)

*** Passthrough execute for ttl blocks
To get the ttl block to process correctly, for rdfpuml use.
#+name: src-babel-passthrough
#+begin_src emacs-lisp
  (defun elot-org-babel-execute-passthrough (body params)
    "Return BODY unchanged when executing an Org Babel block.

  This function is used to define a passthrough execution behavior
  for Org Babel blocks with the language `ttl'.  It ensures that
  the contents of a `#+begin_src ttl' block are returned as-is,
  without any processing or transformation.

  This is useful for passing Turtle (TTL) content to other source
  blocks without modification.

  PARAMS is ignored."
    (progn
      (always params)  ;; ignore argument
      body))

  (unless (fboundp #'org-babel-execute:ttl)
    (defalias #'org-babel-execute:ttl #'elot-org-babel-execute-passthrough))
#+end_src

