elot-defs.org
**** Code blocks
#+name: src-tempo-codeblock
#+begin_src emacs-lisp
  (tempo-define-template "elot-block-robot-metrics"
   '(
     (org-open-line 1) p
     "#+call: robot-metrics(omnfile=\"" (elot-context-localname) ".omn\") :eval never-export" >
     (progn (message "Execute blocks with C-c C-c") ""))
   "<obm"
   "ELOT ontology metrics from ROBOT"
   'org-tempo-tags)

  (tempo-define-template "elot-block-sparql-select"
   '(
     (org-open-line 1)
  "#+name: " (p "Select query name: ") > n
  "#+begin_src sparql :url \"" (elot-context-localname) ".omn\" :eval never-export :exports results
    select
    {

    }
  ,#+end_src" n
     (progn (message "Execute blocks with C-c C-c") ""))
   "<obs"
   "ELOT SPARQL SELECT from OMN "
   'org-tempo-tags)

  (tempo-define-template "elot-block-sparql-construct"
   '(
     (org-open-line 1)
  "#+name: " (p "Construct query name: ") > n
  "#+begin_src sparql :url \"" (elot-context-localname) ".omn\" :eval never-export :exports results"
  " :format ttl :wrap \"src ttl\" :cache yes :post kill-prefixes(data=*this*) :eval never-export
    construct {

    } {

    }
  ,#+end_src" n
     (progn (message "Execute blocks with C-c C-c") ""))
   "<obc"
   "ELOT SPARQL CONSTRUCT from OMN "
   'org-tempo-tags)

  (tempo-define-template "elot-block-rdfpuml-diagram"
   '(
     (org-open-line 1)
     "#+name: rdfpuml:" (p "Name of Turtle source block for diagram: " ttl-source) > n
     "#+call: rdfpuml-block(ttlblock=\"" (s ttl-source) "\") :eval never-export" > n
     "#+caption: " (p "Caption: ") > n
     "#+results: rdfpuml:" (s ttl-source) > n
     (progn (message "Execute blocks with C-c C-c") ""))
   "<obm"
   "ELOT ontology metrics from ROBOT"
   'org-tempo-tags)
#+end_src
**** Hydra interface S-F5
First "forward declare" the functions referenced in the Hydra, to
avoid byte compiler warnings.
#+name: src-tempo-fwd-declare
#+begin_src emacs-lisp
(declare-function tempo-template-elot-block-robot-metrics "tempo")
(declare-function tempo-template-elot-block-sparql-select "tempo")
(declare-function tempo-template-elot-block-sparql-construct "tempo")
(declare-function tempo-template-elot-block-rdfpuml-diagram "tempo")
(declare-function tempo-template-elot-doc-header "tempo")
(declare-function tempo-template-elot-ont-skeleton "tempo")
#+end_src

#+name: src-hydra-menu
#+begin_src emacs-lisp
  (defhydra elot-hydra (:color blue :hint nil)
    "
   --- ELOT helpdesk --- press F5 to toggle labels ---

   Output:  [_t_] ontology    [_h_] HTML

   Insert                    Code block             Document
  --------------------------------------------------------------
   [_r_] resource id        <_obm_ metrics             <_odh_ header
  <_ocp_ primitive class    <_obs_ sparql select       <_ods_ ontology
  <_ocd_ defined class      <_obc_ sparql construct
   <_op_ property           <_obd_ rdfpuml diagram
  "
    ("r" (elot-label-lookup))
    ("ocp" (progn (outline-next-heading) (tempo-template-elot-class-iof-primitive)))
    ("ocd" (progn (outline-next-heading) (tempo-template-elot-class-iof-defined)))
    ("op" (progn (outline-next-heading) (tempo-template-elot-property-iof)))
    ("t" (org-babel-tangle))
    ("h" (browse-url-of-file (expand-file-name (org-html-export-to-html))))
    ("obm" (tempo-template-elot-block-robot-metrics))
    ("obs" (tempo-template-elot-block-sparql-select))
    ("obc" (tempo-template-elot-block-sparql-construct))
    ("obd" (tempo-template-elot-block-rdfpuml-diagram))
    ("odh" (tempo-template-elot-doc-header))
    ("ods" (tempo-template-elot-ont-skeleton)))
#+end_src

#+RESULTS:
: elot-hydra/body

Keybinding, customizable.
#+name: src-hydra-keybinding
#+begin_src emacs-lisp
  (defcustom elot-key-open-hydra (kbd "S-<f5>")
    "Keybinding to open the ELOT hydra."
    :type 'key-sequence
    :group 'elot)

  (defcustom elot-key-toggle-labels (kbd "<f5>")
    "Keybinding to toggle label display in ELOT buffers."
    :type 'key-sequence
    :group 'elot)

  (defun elot-setup-org-keybindings ()
    (local-set-key elot-key-open-hydra #'elot-hydra/body)
    (local-set-key elot-key-toggle-labels #'elot-toggle-label-display))
#+end_src

*** ROBOT
**** Read tsv into org table
This function is currently not in use.
#+name: src-tsv-table
#+begin_src emacs-lisp
  (defun elot-tsv-to-table (filename)
    "Read tab separated values file FILENAME and insert an Org table at point."
    (let* ((lines (with-temp-buffer
                   (insert-file-contents filename)
                   (split-string (buffer-string) "\n")))
           (header (split-string (car lines) "\t"))
           (body (mapcar
                  (lambda (line) (split-string line "\t"))
                  (butlast (cdr lines)))))  ;; check this is ok
      (cons header (cons 'hline body))))
#+end_src
**** ROBOT metrics
Insert a =call= to ROBOT for =measure=, returns a table of ontology
metrics.
#+name: src-robot-metrics
#+begin_src emacs-lisp :results none
  (tempo-define-template "robot-metrics"
   '("#+call: robot-metrics(omnfile=\""
     (p "Ontology filename to read for metrics: ") "\")"
     (progn (org-ctrl-c-ctrl-c) ""))
     "<om"
     "ROBOT metrics"
     'org-tempo-tags)
#+end_src
*** End with "provides"
#+name: src-provide-library
#+begin_src emacs-lisp :comments none
(provide 'elot)
;;; elot.el ends here
#+end_src

** Default settings -- tangling to ~elot-package/elot-defaults.el~
:PROPERTIES:
:header-args: :tangle ./elot-package/elot-defaults.el :comments link
:END:
*** Package header
#+name: src-package-header-defaults
#+begin_src emacs-lisp :comments nil
  ;;; elot-defaults.el --- Emacs Literate Ontology Tool (ELOT): Default settings   -*- lexical-binding: t; no-native-compile: t; -*-

  ;; Copyright (C) 2024, 2025 Johan W. Klüwer

  ;; Author: Johan W. Klüwer <johan.w.kluwer@gmail.com>
  ;; URL: https://github.com/johanwk/elot

  ;; This file is not part of GNU Emacs.

  ;; This program is free software; you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.

  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.

  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

  ;;; Commentary:

  ;; Default startup settings for ELOT.
  ;;
  ;; This file is intended to be loaded when an ELOT org-mode file is
  ;; opened.  To achieve this, add the following text to the first line
  ;; of your file:
  ;;
  ;;   # -*- eval: (load-library "elot-defaults") -*-

  ;;; Code:
#+end_src

*** The settings
#+name: src-settings-defaults
#+begin_src emacs-lisp
  ;; default settings, replaces Local Variables block
  (require 'ox-latex)
  (setq-local
   org-confirm-babel-evaluate nil
   org-export-allow-bind-keywords t
   org-babel-default-inline-header-args '((:exports . "code"))
   org-latex-src-block-backend 'listings
   org-latex-prefer-user-labels t
   org-latex-image-default-scale .8
   tempo-interactive t
   time-stamp-line-limit 100
   time-stamp-format "%Y-%m-%d %H:%M"
   time-stamp-active t
   time-stamp-start "(version of "
   time-stamp-end ")"
   org-startup-folded 'show2levels
   org-export-with-sub-superscripts nil  ; preserve "_"
   org-export-headline-levels 8  ; deep numbering
   org-export-with-section-numbers 8  ; deep numbering
   org-latex-default-class "elot-scrreprt"
   org-latex-packages-alist
   (append org-latex-packages-alist
           '(("" "svg" t)
             ("" "enumitem" t)
             "\\setlist[description]{font=\\normalfont\\itshape\\space}"
             "\\sloppy"
             ;; subsubsubsection, see https://tex.stackexchange.com/questions/356567/subsubsubsection-for-scrbook
             "\\DeclareNewSectionCommand[style=section,counterwithin=subsubsection,afterskip=1.5ex plus .2ex,"
             "  beforeskip=3.25ex plus 1ex minus .2ex,afterindent=false,level=\\paragraphnumdepth,tocindent=10em,"
             "  tocnumwidth=5em]{subsubsubsection}"
             "\\RedeclareSectionCommand[level=\\numexpr\\subsubsubsectionnumdepth+1\\relax,toclevel=\\numexpr\\subsubsubsectiontocdepth+1\\relax,]{paragraph}"
             "\\RedeclareSectionCommand[level=\\numexpr\\subsubsubsectionnumdepth+2\\relax,toclevel=\\numexpr\\subsubsubsectiontocdepth+2\\relax,]{subparagraph}"
             "\\RedeclareSectionCommand[counterwithin=subsubsubsection,tocnumwidth=6em]{paragraph}"
             "\\RedeclareSectionCommand[tocnumwidth=7em]{subparagraph}"
             ;; section numbers in margin
             "\\RedeclareSectionCommands[runin=false,afterskip=1.5ex plus .2ex,afterindent=false,indent=0pt]{paragraph,subparagraph}"
             "\\renewcommand\\othersectionlevelsformat[3]{\\makebox[0pt][r]{#3\\autodot\\enskip}}"
             "\\renewcommand\\sectionformat{\\makebox[0pt][r]{\\thesection\\autodot\\enskip}}"
             "\\renewcommand\\subsectionformat{\\makebox[0pt][r]{\\thesubsection\\autodot\\enskip}}"
             "\\renewcommand\\subsubsectionformat{\\makebox[0pt][r]{\\thesubsubsection\\autodot\\enskip}}"
             "\\renewcommand\\subsubsubsectionformat{\\makebox[0pt][r]{\\thesubsubsubsection\\autodot\\enskip}}"
             "\\renewcommand\\paragraphformat{\\makebox[0pt][r]{\\theparagraph\\autodot\\enskip}}"
             "\\renewcommand\\subparagraphformat{\\makebox[0pt][r]{\\thesubparagraph\\autodot\\enskip}}"
             "\\PassOptionsToPackage{hyphens}{url}"
             "\\hypersetup{pdfborder=0 0 0,colorlinks=true}"
             "\\lstdefinelanguage{omn}{basicstyle=\\small\\ttfamily,commentstyle=\\color{gray},frame=single,breaklines=true,breakatwhitespace=true,postbreak=\\mbox{{\\color{gray}\\tiny$\\rightarrow$}},tabsize=2,comment=[l]{\\#},columns=fullflexible,}"
             "\\lstdefinelanguage{ttl}{basicstyle=\\footnotesize\\ttfamily,commentstyle=\\color{gray},frame=single,breaklines=true,breakatwhitespace=true,postbreak=\\mbox{{\\color{gray}\\tiny$\\rightarrow$}},tabsize=2,comment=[l]{\\#},columns=fullflexible,}"
             "\\lstdefinelanguage{sparql}{basicstyle=\\footnotesize\\ttfamily,commentstyle=\\color{gray},frame=single,breaklines=true,breakatwhitespace=true,postbreak=\\mbox{{\\color{gray}\\tiny$\\rightarrow$}},tabsize=2,comment=[l]{\\#},columns=fullflexible,}")))
  (progn
    (org-cycle-set-startup-visibility)
    (load-library "elot")
    (defvar-local elot-buffer-p t
      "Indicates that this buffer is an ELOT buffer.")
    (org-babel-lob-ingest (concat (file-name-directory (locate-library "elot")) "elot-lob.org"))
    (elot-update-link-abbrev)
    (add-to-list 'org-latex-classes
                 '("elot-scrreprt"
                   "\\documentclass[11pt,a4paper,numbers=noenddot,twoside=false]{scrreprt}
  [DEFAULT-PACKAGES]
  [PACKAGES]
  [EXTRA]"
                   elot-ontology-resource-section))
    ;;
    (modify-syntax-entry ?\: "w")
    (modify-syntax-entry ?\_ "w")
    (add-hook 'org-babel-pre-tangle-hook #'elot--remember-org-source)
    (add-hook 'org-babel-post-tangle-hook #'elot-tangled-omn-to-ttl
              'local) ;; make it a local hook only
    (add-hook 'org-babel-after-execute-hook #'org-redisplay-inline-images 'local)
    (declare-function elot-update-link-abbrev "elot.el")
    (add-hook 'after-save-hook #'elot-update-link-abbrev)
    ;; the label display functions are in a separate file
    (require 'elot-label-display)
    (declare-function elot-label-display-setup "elot-label-display.el")
    (elot-label-display-setup)
    (declare-function elot-hydra/body "elot.el")
    (declare-function elot-toggle-label-display "elot-label-display.el")
    (elot-setup-org-keybindings))
#+end_src
